#+TITLE: Character Name
#+LATEX_CLASS: dnd
#+OPTIONS: toc:nil title:nil H:5 num:nil
#+EXCLUDE_TAGS: noexport
#+LATEX: % Work around to make links to spells work
#+LATEX: \let\oldlabel\label
#+LATEX: \let\oldhyperref\hyperref
#+LATEX: \renewcommand{\label}[1]{\oldlabel{#1}\hypertarget{#1}{}}
#+LATEX: \renewcommand{\hyperref}[2][]{\hyperlink{#1}{#2}}
*** Ability Scores
    #+NAME: ATTRIBUTES
    #+ATTR_DND: :color DmgCoral
    | *Ability*   | *Value* | *Mod* | *Save* |
    | *STR*       |       8 |    -1 |     -1 |
    | *DEX*   *** |      14 |    +2 |     +4 |
    | *CON*       |      12 |    +1 |     +1 |
    | *INT*       |      10 |    +0 |     +0 |
    | *WIS*       |      13 |    +1 |     +1 |
    | *CHA*   *** |      15 |    +2 |     +4 |
    #+TBLFM: @2$3..@>$3='(org-dnd-char-stat-to-mod $2) ::  @2$4..@>$4='(if (string-match "\\*\\*\\*" $1) (org-dnd-char-mod-string (+ (string-to-number $3)  (string-to-number remote(LEVEL, @2$2)))) $3)

**** Spell Slots
 #+NAME: SPELLSLOTS
 #+ATTR_DND: :color PhbMauve
 | *Spell Level* | *Slots* | *Expended* |
 |             1 |       2 |          0 |
 |             2 |       0 |          0 |
 |             3 |       0 |          0 |
 |             4 |       0 |          0 |
 |             5 |       0 |          0 |
 |             6 |       0 |          0 |
 |             7 |       0 |          0 |
 |             8 |       0 |          0 |
 |             9 |       0 |          0 |
 #+TBLFM: @2$2..@>$2='(aref (org-dnd-char-spell-slots remote(LEVEL, @1$2)) (- (string-to-number $1) 1))

\FloatBarrier

*** Equipment
*Proficiencies*
Light armor, simple weapons, hand crossbows, longswords,
     rapiers, shortswords, disguise kit, ...

 #+NAME: WEAPONS
 | *Weapon*     | *ATK Bonus* | *Damage/Type*  | *Range* |
 | Rapier       |          +5 | 1d8+3 piercing |         |
 | Crossbow (l) |          +5 | 1d8+3 piercing | 80/320  |

  #+NAME: COIN
  | *CP*          | 0 |
  | *SP*          | 0 |
  | *EP*          | 0 |
  | *GP*          | 0 |
  | *PP*          | 0 |
  | Total (in GP) | 0 |
#+TBLFM: @>$2= @1$2 / 100 + @2$2 / 10 + @3$2 / 2 + @4$2 + @5$2 * 10

  #+NAME: GEAR
  #+ATTR_DND: :long dndlongtable
  | *Item*               | *Weight* | *Notes*   | *#* |
  | *** Rapier           |        5 |           |   1 |
  | *** Leather Armor    |       10 | AC=11+DEX |   1 |
  | *** Crossbow (l)     |        5 |           |   1 |
  | ball bearings  x1000 |        2 |           |  70 |
  | *total weight*       |      160 | /120 max  |     |
  #+TBLFM: @>$2=vsum(@2$2..@-1$2 * @2$4..@-1$4) :: @>$3 = '(concat "/" (number-to-string (* 15 (string-to-number remote(ATTRIBUTES, @2$2)))) " max")

  \noindent *** indicates that the item is currently equipped (being worn,
  sheathed, on back or otherwise accessible)

**** starting equipment buy in calculator :noexport:
   I rolled 130 GP
   | item                 | weight | price (gp) | quantity |
   | leather armor        |     10 |         10 |        1 |
   | crossbow (l)         |      5 |         25 |        1 |
   | rapier               |      2 |         25 |        1 |
   | ball bearings  x1000 |      2 |          1 |       70 |
   | total                |    157 |        130 |          |
   #+TBLFM: @>$2=vsum(@2$2..@>>$2 * @2$4..@>>$4) :: @>$3=vsum(@2$3..@>>$3 * @2$4..@-1$4)
* Spells
#+BEGIN_SRC python :exports results :results output drawer :var spell_table=SPELLS_KNOWN
# auto generate spell entries from the SPELLS_KNOWN TABLE
# add any other other spells to show not listed under 'known spells' (mostly for spells from features/feats)
# ex: additional_spells = ["Levitate", "Gust"]
additional_spells = []
import json
with open('./srd_spells/spells.json') as f:
    spell_list = json.load(f)
spells_dict = {spell['name']: spell for spell in spell_list}
spell_templ = """
     <<{link_name}>>
    ,#+NAME: {name}
    ,#+ATTR_SPELL: :level {level} :school {school} :range {range} :cast {casting_time} :duration {duration} :comp {component_string}
    ,#+BEGIN_SPELL
    {description} {higher_levels_string}
    ,#+END_SPELL
"""
spell_list = sorted(additional_spells
                    +
                    [row[1].split(']')[0].replace('[', '')
                     for row in spell_table[1:]])
for spell_name in spell_list:
    this_spell = {}
    try:
        this_spell.update(spells_dict[spell_name])
    except KeyError as e:
        this_spell['name'] = spell_name
        this_spell['link_name'] = spell_name
        this_spell['school'] = 'n/a'
        this_spell['range'] = 'n/a'
        this_spell['casting_time'] = 'n/a'
        this_spell['duration'] = 'n/a'
        this_spell['components'] = {'raw': 'n/a'}
        this_spell['level'] = 'n/a'
        this_spell['description'] = 'not available (not in srd json file)'
        this_spell['ritual'] = None
    this_spell['link_name'] = spell_name
    this_spell['component_string'] = this_spell['components']['raw']
    if this_spell['level'] == 'cantrip':
        this_spell['level'] = 0
    if this_spell['ritual']:
        this_spell['school'] = "{} (ritual)".format(this_spell['school'])
    if 'higher_levels' in this_spell:
        this_spell['higher_levels_string'] = "\n\n*At Higher Levels.* {}".format(this_spell['higher_levels'])
    else:
        this_spell['higher_levels_string'] = ""
    this_spell['description'] = this_spell['description'].replace('*', '-')
    try:
        print(spell_templ.format(**this_spell))
    except KeyError as e:
        print('{} does not have a value for {}'.format(spell_name, e))
#+END_SRC

#+RESULTS:
:results:
:end:

** New Spells explorer (if you like python) :noexport:
List spells by level/class
#+BEGIN_SRC python :exports results :results output drawer
import json
with open('./srd_spells/spells.json') as f:
    spell_list = json.load(f)
for spell in spell_list:
    if spell['level'] == '1' and 'bard' in spell['classes']:
        print(spell['name'])
        print(spell['range'])
        print(spell['casting_time'])
        print(spell['duration'])
        print()
        print(spell['description'].replace('*', '-'))
        print()
        print()
        print()
#+END_SRC

#+RESULTS:
:RESULTS:

:END:

*  testing elisp spell block :noexport:

want to port the python bit to elisp, working on here

hashmap vs alist, does it matter?

#+begin_src elisp

;;; Code:

(defun get-spell-data (spell_names)
  "Get alist with a key for each element of SPELL_NAMES.
Each value is the corresponding SRD data, no entry if element is not in SRD."
  (let ((spell-data (make-hash-table :test 'equal))
        (json-array-type 'list) (json-false 'nil))
    (dolist (spell (json-read-file "./srd_spells/spells.json") spell-data)
      (let ((this_name (alist-get 'name spell)))
        (if (member this_name spell_names)
            (puthash this_name spell spell-data))))))

(alist-get 'classes (gethash "Levitate" (get-spell-data '("Levitate" "Gust"))))

#+end_src

#+RESULTS:
| sorcerer | wizard |


#+begin_src elisp

;;; Code:

(defun get-spell-data-a (spell_names)
  "Get alist with a key for each element of SPELL_NAMES.
Each value is the corresponding SRD data, no entry if element is not in SRD."
  (let ((spell-data 'nil)
        (json-array-type 'list) (json-false 'nil))
    (dolist (spell (json-read-file "./srd_spells/spells.json") spell-data)
      (let ((this_name (alist-get 'name spell)))
        (if (member this_name spell_names)
            (push (cons (intern this_name) spell) spell-data)))
      )
    ))

(alist-get 'Levitate (get-spell-data-a '("Levitate" "Gust")))

#+end_src

#+RESULTS:
: ((casting_time . 1 action) (classes sorcerer wizard) (components (material . t) (materials_needed either a small leather loop or a pieee of golden wire bent into a cup shape with a long shank on one end) (raw . V, S, M (either a small leather loop or a pieee of golden wire bent into a cup shape with a long shank on one end)) (somatic . t) (verbal . t)) (description . One creature or object of your choice that you can see within range rises vertically, up to 20 feet, and remains suspended there for the duration. The spell can levitate a target that weighs up to 500 pounds. An unwilling creature that succeeds on a Constitution saving throw is unaffected.
:
: The target can move only by pushing or pulling against a fixed object or surface within reach (such as a wall or a ceiling), which allows it to move as if it were climbing. You can change the target's altitude by up to 20 feet in either direction on your turn. If you are the target, you can move up or down as part of your move. Otherwise, you can use your action to move the target, which must remain within the spell's range.
:
: When the spell ends, the target floats gently to the ground if it is still aloft.) (duration . Concentration, up to 10 minutes) (level . 2) (name . Levitate) (range . 60 feet) (ritual) (school . transmutation) (tags sorcerer wizard level2) (type . 2nd-level transmutation))

